// "Use strict" 是 JavaScript 中的一个严格模式（strict mode）声明。
// 当你在脚本或函数的开头使用 "use strict" 时，JavaScript 引擎将进入严格模式，强制执行更严格的语法和规则。

// 严格模式的特点包括：

// 1. 变量必须声明： 变量必须使用 var, let, 或 const 显式声明，否则将抛出错误。
// 2. 全局对象的限制： 在全局作用域中，this 的值是 undefined。这样可以避免不小心将全局对象作为上下文。
// 3. 禁止删除变量： 无法通过 delete 操作符删除变量、函数或函数的参数。
// 4. 禁止重复参数： 函数的参数名不能重复。
// 5. 保留字用法限制： 禁止使用一些在未来可能成为 JavaScript 关键字的词作为变量名。
// 6. 禁止八进制字面量： 八进制字面量（以 0 开头的数字）被禁止。
// 7. 允许严格模式下的保留字： 可以使用一些在正常模式下被禁止的保留字（如 implements、interface、package 等）作为变量名。
// 8. eval 限制： 禁止使用 eval 创建变量或函数。
// 9. eval 和 arguments 作为变量名的限制： 不能将 eval 和 arguments 作为变量名或函数名。
